tutorials/heatTransfer/directChillFoam/Vreeman2002/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tInitial    943.48;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $tInitial;

boundaryField
{
    "(ceramic|hot-top)"
    {
        type            zeroGradient;
    }
    
    graphite
    {
        type            mouldHTC;
        mode            coefficient;
        h1              uniform 1325.0;
        h2              uniform 40.0;
        Ta              uniform 291.13;
        kappaMethod     fluidThermo;
        relaxation      1.0;
        value           uniform 291.13;
    }

    "(mould|air-gap)"
    {
        type            mouldHTC;
        mode            coefficient;
        h1              uniform 1250.0;
        h2              uniform 40.0;
        Ta              uniform 291.13;
        kappaMethod     fluidThermo;
        relaxation      1.0;
        value           uniform 291.13;
    }

    water-film
    {
        type            waterFilmHTC;
        mode            coefficient;
        h               uniform 10000;
        hfile           yes;
        Ta              uniform 291.13;
        kappaMethod     fluidThermo;
        relaxation      0.5;
        // value           uniform 291.13;
        value           $internalField;
    }

    ram
    {
        type            zeroGradient;
    }

    free-surface
    {
        type            fixedValue;
        value           uniform $tInitial;
    }

    symmetry_planes
    {
        type            symmetry;
    }
}

// ************************************************************************* //
