tutorials/heatTransfer/directChillFoam/Vreeman2002/0.orig/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

UCast    (0 0 -0.001);
UInitial    (0 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $UCast;

boundaryField
{
    ram
    {
        type            fixedValue;
        value           uniform $UCast;
        // type            zeroGradient;
    }

    "(ceramic|hot-top)"
    {
        type            noSlip;
    }
    
    "(graphite|mould|air-gap|water-film)"
    {
        type            movingShell;
        value           $internalField;
    }

    free-surface
    {
        type            fixedValue;
        value           uniform (0 0 0);
        // type            zeroGradient;
    }

    symmetry_planes
    {
        type            symmetry;
    }
}

// ************************************************************************* //
