tutorials/heatTransfer/directChillFoam/Vreeman2002/0.orig/melt1_alpha1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      melt1_alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(water-film|mould|air-gap|graphite|ceramic|hot-top|free-surface)"
    {
        type            zeroGradient;
    }

    ram
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    symmetry_planes
    {
        type            symmetry;
    }
}


// ************************************************************************* //
