tutorials/heatTransfer/directChillFoam/Vreeman2002/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    "(water-film|mould|air-gap|graphite|ceramic|hot-top)"
    {
        type            calculated;
        value           $internalField;
    }

    ram
    {
        type            calculated;
        value           $internalField;
    }

    free-surface
    {
        type            calculated;
        value           $internalField;
    }

    symmetry_planes
    {
        type            symmetry;
    }
}

// ************************************************************************* //
