tutorials/heatTransfer/directChillFoam/Vreeman2002/constant/HTC_T
(
    (273.0000  676.54117)
    (276.9196  676.54117)
    (280.8392  676.54117)
    (284.7588  676.54117)
    (288.6784  676.54117)
    (292.5980  676.54117)
    (296.5176  676.54117)
    (300.4372  676.54117)
    (304.3568  676.54117)
    (308.2764  676.54117)
    (312.1960  676.54117)
    (316.1156  676.54117)
    (320.0352  676.54117)
    (323.9548  676.54117)
    (327.8744  676.54117)
    (331.7940  676.54117)
    (335.7136  676.54117)
    (339.6332  676.54117)
    (343.5528  676.54117)
    (347.4724  676.54117)
    (351.3920  676.54117)
    (355.3116  676.54117)
    (359.2312  676.54117)
    (363.1508  676.54117)
    (367.0704  676.54117)
    (370.9899  676.54117)
    (374.9095  676.54117)
    (378.8291 1251.93830)
    (382.7487 3151.20439)
    (386.6683 7104.77415)
    (390.5879 13706.20445)
    (394.5075 23459.03246)
    (398.4271 36793.21786)
    (402.3467 54078.10826)
    (406.2663 75632.75632)
    (410.1859 101734.19887)
    (414.1055 132624.15278)
    (418.0251 168514.46984)
    (421.9447 209591.61101)
    (425.8643 256020.33967)
    (429.7839 307946.78846)
    (433.7035 365501.02026)
    (437.6231 428799.17797)
    (441.5427 497945.29826)
    (445.4623 573032.84888)
    (449.3819 654146.03747)
    (453.3015 741360.93069)
    (457.2211 834746.41478)
    (461.1407 934365.02327)
    (465.0603 1040273.65283)
    (468.9799 1152524.18439)
    (472.8995 1271164.02390)
    (476.8191 1396236.57469)
    (480.7387 1527781.65114)
    (484.6583 1665835.84212)
    (488.5779 1810432.83116)
    (492.4975 1961603.67921)
    (496.4171 2119377.07500)
    (500.3367 2283779.55724)
    (504.2563 2454835.71240)
    (508.1759 2632568.35088)
    (512.0955 2816998.66464)
    (516.0151 3008146.36817)
    (519.9347 3206029.82505)
    (523.8543 3410666.16175)
    (527.7739 3622071.37004)
    (531.6935 3840260.39947)
    (535.6131 4065247.24087)
    (539.5327 4297045.00202)
    (543.4523 4535665.97624)
    (547.3719 4781121.70466)
    (551.2915 5033423.03291)
    (555.2111 5292580.16269)
    (559.1307 5558602.69892)
    (563.0503 5831499.69270)
    (566.9698 6111279.68068)
    (570.8894 6397950.72109)
    (574.8090 6691520.42682)
    (578.7286 6991995.99572)
    (582.6482 7299384.23854)
    (586.5678 7613691.60458)
    (590.4874 7934924.20539)
    (594.4070 8263087.83654)
    (598.3266 8598187.99786)
    (602.2462 8940229.91198)
    (606.1658 9289218.54163)
    (610.0854 9645158.60559)
    (614.0050 10008054.59352)
    (617.9246 10377910.77966)
    (621.8442 10754731.23563)
    (625.7638 11138519.84228)
    (629.6834 11529280.30074)
    (633.6030 11927016.14270)
    (637.5226 12331730.74002)
    (641.4422 12743427.31361)
    (645.3618 13162108.94186)
    (649.2814 13587778.56838)
    (653.2010 14020439.00932)
    (657.1206 14460092.96020)
    (661.0402 14906743.00227)
    (664.9598 15360391.60855)
    (668.8794 15821041.14939)
    (672.7990 16288693.89781)
    (676.7186 16763352.03435)
    (680.6382 17245017.65184)
    (684.5578 17733692.75966)
    (688.4774 18229379.28793)
    (692.3970 18732079.09136)
    (696.3166 19241793.95287)
    (700.2362 19758525.58707)
    (704.1558 20282275.64348)
    (708.0754 20813045.70960)
    (711.9950 21350837.31378)
    (715.9146 21895651.92796)
    (719.8342 22447490.97026)
    (723.7538 23006355.80739)
    (727.6734 23572247.75699)
    (731.5930 24145168.08980)
    (735.5126 24725118.03171)
    (739.4322 25312098.76576)
    (743.3518 25906111.43394)
    (747.2714 26507157.13903)
    (751.1910 27115236.94619)
    (755.1106 27730351.88462)
    (759.0302 28352502.94900)
    (762.9497 28981691.10100)
    (766.8693 29617917.27055)
    (770.7889 30261182.35722)
    (774.7085 30911487.23139)
    (778.6281 31568832.73547)
    (782.5477 32233219.68498)
    (786.4673 32904648.86962)
    (790.3869 33583121.05431)
    (794.3065 34268636.98012)
    (798.2261 34961197.36522)
    (802.1457 35660802.90574)
    (806.0653 36367454.27660)
    (809.9849 37081152.13236)
    (813.9045 37801897.10791)
    (817.8241 38529689.81928)
    (821.7437 39264530.86426)
    (825.6633 40006420.82313)
    (829.5829 40755360.25927)
    (833.5025 41511349.71978)
    (837.4221 42274389.73604)
    (841.3417 43044480.82429)
    (845.2613 43821623.48620)
    (849.1809 44605818.20929)
    (853.1005 45397065.46752)
    (857.0201 46195365.72171)
    (860.9397 47000719.41999)
    (864.8593 47813126.99825)
    (868.7789 48632588.88054)
    (872.6985 49459105.47951)
    (876.6181 50292677.19671)
    (880.5377 51133304.42306)
    (884.4573 51980987.53911)
    (888.3769 52835726.91544)
    (892.2965 53697522.91297)
    (896.2161 54566375.88324)
    (900.1357 55442286.16878)
    (904.0553 56325254.10332)
    (907.9749 57215280.01214)
    (911.8945 58112364.21228)
    (915.8141 59016507.01284)
    (919.7337 59927708.71520)
    (923.6533 60845969.61327)
    (927.5729 61771289.99372)
    (931.4925 62703670.13621)
    (935.4121 63643110.31359)
    (939.3317 64589610.79210)
    (943.2513 65543171.83160)
    (947.1709 66503793.68571)
    (951.0905 67471476.60206)
    (955.0101 68446220.82241)
    (958.9296 69428026.58284)
    (962.8492 70416894.11393)
    (966.7688 71412823.64092)
    (970.6884 72415815.38382)
    (974.6080 73425869.55764)
    (978.5276 74442986.37243)
    (982.4472 75467166.03353)
    (986.3668 76498408.74162)
    (990.2864 77536714.69288)
    (994.2060 78582084.07912)
    (998.1256 79634517.08790)
    (1002.0452 80694013.90264)
    (1005.9648 81760574.70274)
    (1009.8844 82834199.66368)
    (1013.8040 83914888.95714)
    (1017.7236 85002642.75109)
    (1021.6432 86097461.20991)
    (1025.5628 87199344.49444)
    (1029.4824 88308292.76213)
    (1033.4020 89424306.16711)
    (1037.3216 90547384.86024)
    (1041.2412 91677528.98926)
    (1045.1608 92814738.69882)
    (1049.0804 93959014.13058)
    (1053.0000 95110355.42328)
)