tutorials/heatTransfer/directChillFoam/Vreeman2002/constant/fL
(
    (  0.0000    0.0000000)
    (820.9800    0.0000000)
    (821.9015    0.0000000)
    (822.8230    0.0000000)
    (823.7445    0.0000000)
    (824.6660    0.0000000)
    (825.5875    0.0000001)
    (826.5090    0.0000003)
    (827.4305    0.0000007)
    (828.3520    0.0000014)
    (829.2735    0.0000027)
    (830.1950    0.0000047)
    (831.1165    0.0000077)
    (832.0380    0.0000123)
    (832.9595    0.0000189)
    (833.8810    0.0000280)
    (834.8025    0.0000405)
    (835.7240    0.0000571)
    (836.6455    0.0000789)
    (837.5670    0.0001070)
    (838.4885    0.0001427)
    (839.4100    0.0001876)
    (840.3315    0.0002434)
    (841.2530    0.0003119)
    (842.1745    0.0003953)
    (843.0960    0.0004960)
    (844.0175    0.0006166)
    (844.9390    0.0007600)
    (845.8605    0.0009294)
    (846.7820    0.0011282)
    (847.7035    0.0013604)
    (848.6250    0.0016299)
    (849.5465    0.0019412)
    (850.4680    0.0022993)
    (851.3895    0.0027092)
    (852.3110    0.0031767)
    (853.2325    0.0037076)
    (854.1540    0.0043085)
    (855.0755    0.0049862)
    (855.9970    0.0057481)
    (856.9185    0.0066019)
    (857.8400    0.0075560)
    (858.7615    0.0086193)
    (859.6830    0.0098010)
    (860.6045    0.0111110)
    (861.5260    0.0125599)
    (862.4475    0.0141587)
    (863.3690    0.0159191)
    (864.2905    0.0178532)
    (865.2120    0.0199740)
    (866.1335    0.0222952)
    (867.0550    0.0248308)
    (867.9765    0.0275959)
    (868.8980    0.0306061)
    (869.8195    0.0338778)
    (870.7410    0.0374280)
    (871.6625    0.0412748)
    (872.5840    0.0454368)
    (873.5055    0.0499335)
    (874.4270    0.0547852)
    (875.3485    0.0600131)
    (876.2700    0.0656392)
    (877.1915    0.0716866)
    (878.1130    0.0781789)
    (879.0345    0.0851410)
    (879.9560    0.0925987)
    (880.8775    0.1005786)
    (881.7990    0.1091083)
    (882.7205    0.1182167)
    (883.6420    0.1279333)
    (884.5635    0.1382890)
    (885.4850    0.1493157)
    (886.4065    0.1610462)
    (887.3280    0.1735146)
    (888.2495    0.1867562)
    (889.1710    0.2008073)
    (890.0925    0.2157054)
    (891.0140    0.2314893)
    (891.9355    0.2481989)
    (892.8570    0.2658754)
    (893.7785    0.2845613)
    (894.7000    0.3043004)
    (895.6215    0.3251377)
    (896.5430    0.3471196)
    (897.4645    0.3702940)
    (898.3860    0.3947099)
    (899.3075    0.4204178)
    (900.2290    0.4474698)
    (901.1505    0.4759193)
    (902.0720    0.5058210)
    (902.9935    0.5372315)
    (903.9150    0.5702084)
    (904.8365    0.6048114)
    (905.7580    0.6411013)
    (906.6795    0.6791407)
    (907.6010    0.7189937)
    (908.5225    0.7607262)
    (909.4440    0.8044056)
    (910.3655    0.8501010)
    (911.2870    0.8978832)
    (912.2085    0.9478248)
    (913.1300    1.0000000)
    (9999.0000    1.0000000)
)