tutorials/heatTransfer/directChillFoam/Vreeman2002/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

melt1
{
    type            mushyZoneSource;
    active          yes;
    
    mushyZoneSourceCoeffs
    {
        selectionMode   all;

        Tliquidus       913.13;
        Tsolidus        820.98;
        L               392000.0;
        g_env           0.7;
        relax           0.5;
        castingVelocity (0 0 -0.001);

        thermoMode      thermo;

        rhoRef          2573.;
        beta            2.25e-5;

        phi             phi;

        // Cu              3.078608e+06; // Assuming K0 = 3.75e-11
        Cu              1.0e+05;
        q               1.0e-06;
    }
}

limitT
{
    type            limitTemperature;
    active          yes;
    selectionMode   all;
    min             291.13;
    max             943.48;
}


// ************************************************************************* //
