tutorials/heatTransfer/directChillFoam/Vreeman2002/constant/kappa
(
    (  0.0000  162.00000)
    (820.9800  162.00000)
    (821.9015  162.00000)
    (822.8230  162.00000)
    (823.7445  162.00000)
    (824.6660  162.00000)
    (825.5875  161.99999)
    (826.5090  161.99998)
    (827.4305  161.99995)
    (828.3520  161.99991)
    (829.2735  161.99982)
    (830.1950  161.99969)
    (831.1165  161.99948)
    (832.0380  161.99917)
    (832.9595  161.99874)
    (833.8810  161.99812)
    (834.8025  161.99729)
    (835.7240  161.99617)
    (836.6455  161.99472)
    (837.5670  161.99283)
    (838.4885  161.99044)
    (839.4100  161.98743)
    (840.3315  161.98369)
    (841.2530  161.97910)
    (842.1745  161.97352)
    (843.0960  161.96677)
    (844.0175  161.95869)
    (844.9390  161.94908)
    (845.8605  161.93773)
    (846.7820  161.92441)
    (847.7035  161.90886)
    (848.6250  161.89080)
    (849.5465  161.86994)
    (850.4680  161.84595)
    (851.3895  161.81848)
    (852.3110  161.78716)
    (853.2325  161.75159)
    (854.1540  161.71133)
    (855.0755  161.66592)
    (855.9970  161.61488)
    (856.9185  161.55767)
    (857.8400  161.49375)
    (858.7615  161.42251)
    (859.6830  161.34334)
    (860.6045  161.25556)
    (861.5260  161.15848)
    (862.4475  161.05136)
    (863.3690  160.93342)
    (864.2905  160.80384)
    (865.2120  160.66174)
    (866.1335  160.50622)
    (867.0550  160.33634)
    (867.9765  160.15107)
    (868.8980  159.94939)
    (869.8195  159.73019)
    (870.7410  159.49232)
    (871.6625  159.23459)
    (872.5840  158.95573)
    (873.5055  158.65446)
    (874.4270  158.32939)
    (875.3485  157.97912)
    (876.2700  157.60217)
    (877.1915  157.19700)
    (878.1130  156.76201)
    (879.0345  156.29555)
    (879.9560  155.79589)
    (880.8775  155.26124)
    (881.7990  154.68974)
    (882.7205  154.07948)
    (883.6420  153.42847)
    (884.5635  152.73464)
    (885.4850  151.99585)
    (886.4065  151.20991)
    (887.3280  150.37452)
    (888.2495  149.48733)
    (889.1710  148.54591)
    (890.0925  147.54774)
    (891.0140  146.49022)
    (891.9355  145.37068)
    (892.8570  144.18635)
    (893.7785  142.93439)
    (894.7000  141.61188)
    (895.6215  140.21578)
    (896.5430  138.74299)
    (897.4645  137.19030)
    (898.3860  135.55444)
    (899.3075  133.83201)
    (900.2290  132.01952)
    (901.1505  130.11341)
    (902.0720  128.10999)
    (902.9935  126.00549)
    (903.9150  123.79603)
    (904.8365  121.47764)
    (905.7580  119.04621)
    (906.6795  116.49757)
    (907.6010  113.82742)
    (908.5225  111.03134)
    (909.4440  108.10482)
    (910.3655  105.04323)
    (911.2870  101.84183)
    (912.2085   98.49574)
    (913.1300   95.00000)
    (9999.0000   95.00000)
)