tutorials/heatTransfer/directChillFoam/Vreeman2002/constant/mu
(
    (  0.0000    0.00128)
    (900.9800    0.00128)
    (901.1015    0.00128)
    (901.2230    0.00128)
    (901.3445    0.00128)
    (901.4660    0.00128)
    (901.5875    0.00128)
    (901.7090    0.00128)
    (901.8305    0.00128)
    (901.9520    0.00128)
    (902.0735    0.00128)
    (902.1950    0.00128)
    (902.3165    0.00128)
    (902.4380    0.00128)
    (902.5595    0.00128)
    (902.6810    0.00128)
    (902.8025    0.00128)
    (902.9240    0.00128)
    (903.0455    0.00128)
    (903.1670    0.00128)
    (903.2885    0.00128)
    (903.4100    0.00128)
    (903.5315    0.00128)
    (903.6530    0.00128)
    (903.7745    0.00128)
    (903.8960    0.00128)
    (904.0175    0.00128)
    (904.1390    0.00128)
    (904.2605    0.00128)
    (904.3820    0.00128)
    (904.5035    0.00128)
    (904.6250    0.00128)
    (904.7465    0.00128)
    (904.8680    0.00128)
    (904.9895    0.00128)
    (905.1110    0.00128)
    (905.2325    0.00128)
    (905.3540    0.00128)
    (905.4755    0.00128)
    (905.5970    0.00128)
    (905.7185    0.00128)
    (905.8400    0.00128)
    (905.9615    0.00128)
    (906.0830    0.00128)
    (906.2045    0.00128)
    (906.3260    0.00128)
    (906.4475    0.00128)
    (906.5690    0.00128)
    (906.6905    0.00128)
    (906.8120    0.00128)
    (906.9335    0.00128)
    (907.0550    0.00128)
    (907.1765    0.00214)
    (907.2980    0.00252)
    (907.4195    0.00281)
    (907.5410    0.00298)
    (907.6625    0.00306)
    (907.7840    0.00309)
    (907.9055    0.00309)
    (908.0270    0.00306)
    (908.1485    0.00303)
    (908.2700    0.00299)
    (908.3915    0.00294)
    (908.5130    0.00289)
    (908.6345    0.00283)
    (908.7560    0.00278)
    (908.8775    0.00272)
    (908.9990    0.00266)
    (909.1205    0.00261)
    (909.2420    0.00255)
    (909.3635    0.00250)
    (909.4850    0.00244)
    (909.6065    0.00239)
    (909.7280    0.00234)
    (909.8495    0.00229)
    (909.9710    0.00224)
    (910.0925    0.00219)
    (910.2140    0.00214)
    (910.3355    0.00209)
    (910.4570    0.00205)
    (910.5785    0.00200)
    (910.7000    0.00196)
    (910.8215    0.00192)
    (910.9430    0.00187)
    (911.0645    0.00183)
    (911.1860    0.00179)
    (911.3075    0.00176)
    (911.4290    0.00172)
    (911.5505    0.00168)
    (911.6720    0.00165)
    (911.7935    0.00161)
    (911.9150    0.00158)
    (912.0365    0.00154)
    (912.1580    0.00151)
    (912.2795    0.00148)
    (912.4010    0.00145)
    (912.5225    0.00142)
    (912.6440    0.00139)
    (912.7655    0.00136)
    (912.8870    0.00133)
    (913.0085    0.00131)
    (913.1300    0.00128)
    (9999.0000    0.00128)
)