tutorials/heatTransfer/directChillFoam/Vreeman2002/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

g_env [ 0 0 0 0 0 0 0 ] 0.7;
rho1 [ 1 -3 0 0 0 0 0 ] 1750;
rho2 [ 1 -3 0 0 0 0 0 ] 2490;
mu1 [ 1 -1 -1 0 0 0 0 ] 1.28e-3;
mu2 [ 1 -1 -1 0 0 0 0 ] 1.28e-3;
DAS [ 0 1 0 0 0 0 0 ] 1.85e-4;


// ************************************************************************* //
