tutorials/heatTransfer/directChillFoam/Vreeman2002/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     directChillFoam;

// startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;
// stopAt          writeNow;

endTime         1000.0;

deltaT          0.01;

// writeControl    timeStep;
writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      5;

writeFormat     binary;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.0;
// maxDeltaT       1;
maxAlphaCo      0.5;

functions
{
    #includeFunc residuals
    #includeFunc gradT
    #includeFunc centreline
    #includeFunc midradius
    #includeFunc subsurface
    #includeFunc surfaces
}

libs (
    "libmyFvOptions.so"
    "libtableThermophysicalModels.so"
    "libtableSpecie.so"
    "libmyCompressibleTurbulenceModels.so"
);

// ************************************************************************* //
