tutorials/heatTransfer/directChillFoam/Vreeman2002/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

     pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          1e-4;
    }

    pcorrFinal
    {
        $pcorr;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          1e-4;
    }

    "(T|p_rghFinal)"
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|omega|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          1e-4;
    }

    "(U|k|omega|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }

    "(h|e|C.*)"
    {
        $U;
        tolerance       1e-8;
        relTol          1e-4;
    }

    "(h|e|C.*)Final"
    {
        $h;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors  2;
    nCorrectors       1;
    nNonOrthogonalCorrectors 0;
    nEnergyCorrectors 3;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        p               1.0;
        T               1.0;
    }
    equations
    {
        "(h|E)"               1.0;
        "(U|k|omega|epsilon)" 1.0;
        ".*"            1.0;
    }
}

// ************************************************************************* //
