tutorials/heatTransfer/directChillFoam/Vreeman2002/system/gradT
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the gradient of a field.

\*---------------------------------------------------------------------------*/

type            grad;
libs            ("libfieldFunctionObjects.so");

field           T;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
