tutorials/heatTransfer/directChillFoam/Vreeman2002/system/mapFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      mapFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patchMap
(
    ram ram 
    water-film water-film
    mould mould
    graphite graphite
    ceramic ceramic
    hot-top hot-top
    free-surface free-surface
);

cuttingPatches
(
    
);


// ************************************************************************* //
